tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "d12frosted/emacs-plus"

brew "aspell"
brew "coreutils"
brew "ghostscript"
brew "git"
brew "git-lfs"
brew "python@3.8"
brew "librsvg"
brew "imagemagick"
brew "ispell"
brew "leiningen"
brew "node"
brew "jq"
brew "ripgrep"
brew "the_silver_searcher"

brew "emacs-plus@28"

cask "dropbox"
cask "firefox"
cask "google-chrome"
cask "google-cloud-sdk"
cask "iterm2"
cask "intellij"
cask "rectangle"
cask "spotify"
cask "mactex"
cask "slack"
cask "karabiner-elements"
cask "licecap"
cask "steam"
cask "zoom"
cask "vlc"
cask "ultimaker-cura"
cask "uhk-agent"
cask "minecraft"
cask "discord"
cask "google-backup-and-sync"
# cask "adobe-creative-cloud"
